issue754/test1/proxy130_thr8.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            2439990
        write:                           0
        other:                           0
        total:                           2439990
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 2439990 (40601.27 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0964s
    total number of events:              45185
    total time taken by event execution: 480.5242s
    response time:
         min:                                  8.43ms
         avg:                                 10.63ms
         max:                                252.44ms
         approx.  95 percentile:              10.75ms

Threads fairness:
    events (avg/stddev):           5648.1250/42.45
    execution time (avg/stddev):   60.0655/0.03