issue754/test1/proxy130_thr8.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            2460942
        write:                           0
        other:                           0
        total:                           2460942
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 2460942 (41006.73 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0131s
    total number of events:              45573
    total time taken by event execution: 480.0047s
    response time:
         min:                                  8.10ms
         avg:                                 10.53ms
         max:                                258.17ms
         approx.  95 percentile:              10.90ms

Threads fairness:
    events (avg/stddev):           5696.6250/13.02
    execution time (avg/stddev):   60.0006/0.01